<template>
    <div class="container py-5 Academy_details">
        <h4 class="text-center">Academy</h4>
        <div class="academydiv_hr_rule d-flex justify-center align-items-end">
            <div class="academydiv">Academy Details</div>
            <div class="hr_rule"></div>
        </div>
        <div class="texttag container py-5">
            <p>নওয়াব ফেয়জে ছা চৌধরানী - জীবনকাল: (১৮৩৪ - ১৯০৪ ইং)। এশিয়া মহাদেশের সর্বশ্রেষ্ঠ মহিলা নওয়াব ফেয়জে ছা
                চৌধরানী জন্মগ্রহণ করেছিলেন ১৮৩৪ সালে লাকসামের পি মগায়ে। তিনি ছিলেন একজন সমাজসেবিকা, নারীশিক্ষার
                অনুপ্রেরক এবং সমাজের অবহেলিত জনগণের জন্য নানা ধরনের উদ্যোগ গ্রহণকারী। বিশেষভাবে নারীদের শিক্ষা ক্ষেত্রে
                তার অবদান ছিল অসামান্য। তিনি প্রতিষ্ঠা করেছিলেন অনেক কেলেজ, মসজিদ, মাদ্রাসা এবং রাঘাট। তার প্রতিষ্ঠিত
                প্রতিষ্ঠানগুলোর মধ্যে "নওয়াব ফেয়জে ছা সরকারি বালিকা বিদ্যালয়" এবং "নওয়াব ফেয়জে ছা সরকারি কলেজ" অন্যতম।
                ১৮৯৪ সালে তিনি নারীশিক্ষা ক্ষেত্রে বিশেষ অবদান রাখার জন্য পুরস্কৃত হন এবং মসজিদ ও মাদ্রাসার পাশাপাশি
                একটি মাসিক মসাফিরখানা প্রতিষ্ঠা করেন।</p>

            <p>
                তিনি ১৮৮৯ সালে রানী ভিক্টোরিয়ার কাছ থেকে "নওয়াব" উপাধি লাভ করেন। তার অবদান বাংলার ইতিহাসে চিরকাল অম্লান
                থাকবে, এবং তার অনেক দান, শিক্ষা প্রতিষ্ঠান ও কর্মকাণ্ড আজও মানুষের উপকারে আসছে। ১৯০৩ সালে তিনি বাংলার
                একজন মহীয়সী নারী হিসেবে পরিচিত হন।
            </p>

            <p>
                নওয়াব ফেয়জে ছা সরকারি কলেজ লাকসাম এলাকার একটি গুরুত্বপূর্ণ শিক্ষা প্রতিষ্ঠান। এটি নারী শিক্ষা, সামাজিক
                উন্নয়ন এবং আধ্যাত্মিকতার ক্ষেত্রে গুরুত্বপূর্ণ ভূমিকা পালন করেছে। তার প্রতিষ্ঠিত স্কুল ও কলেজে
                ছাত্র-ছাত্রীরা শিক্ষাগ্রহণ করে এবং সমাজের উন্নতির জন্য কাজ করে আসছে। ১৯৪৩ সালে ইসলামীক ইন্সটিটিউট কেলজ
                এবং ১৯৬৪ সালে নওয়াব ফেয়জে ছা ডিগ্রি কলেজ প্রতিষ্ঠিত হয়। ১৯৮২ সালে বাংলাদেশ সরকার এটিকে জাতীয়করণ করে
                নওয়াব ফেয়জে ছা সরকারি কলেজ হিসেবে পরিচিতি পায়। বর্তমানে এখানে প্রায় ৫ হাজার শিক্ষার্থী পড়াশোনা করছে এবং
                এটি বিভিন্ন শাখায় উচ্চশিক্ষা প্রদান করছে।
            </p>

            <p>
                ফেয়জে ছা চৌধরানীর উদ্যোগ এবং দানের কারণে বাংলার ইতিহাসে তার নাম অমর হয়ে থাকবে। তার প্রতিষ্ঠিত
                প্রতিষ্ঠানগুলি বাংলাদেশের শিক্ষা ক্ষেত্রে আজও গুরুত্বপূর্ণ ভূমিকা পালন করছে।
            </p>

        </div>

    </div>
</template>

<script>
export default {
    name: "AcademyDetails",
    setup() {
        return {

        }
    }
}
</script>
<style scoped>
.academydiv {
    width: 190px;
    background-color: red;
    text-align: center;
    padding: 5px;
    color: white;
}

.hr_rule {
    width: 100%;
    height: 2px;
    padding: 2px;
    background-color: rgb(29, 6, 233);
}
.texttag{
    text-align: justify;
}
</style>